[
  {
    "title": "Stage & Discipline Committee Member - Spandan Cultural Fest MIT",
    "event": "Spandan Cultural Fest",
    "organization": "MIT World Peace University",
    "year": "2026",
    "icon": "groups",
    "description": "Managed stage coordination, ensured discipline, and assisted in smooth execution of university-level cultural events. Collaborated with event teams and awardees to maintain organized event flow and logistics."
  },
  {
    "title": "Event Coordinator",
    "event": "Agile Methodology Guest Lecture & Workshop",
    "organization": "MIT World Peace University, Pune",
    "year": "2025",
    "icon": "event",
    "description": "Coordinated with faculty and student teams to organize and manage an Agile Methodology workshop led by industry expert Mr. Mukkesh Shanmugam. Assisted in event planning, logistics, and execution, ensuring smooth coordination and successful delivery. Gained practical exposure to Agile principles, Scrum practices, and real-world software development workflows."
  },
  {
    "title": "Event Coordinator",
    "event": "Next-Gen AI Tools for Data, Design & Workflow Workshop",
    "organization": "MIT World Peace University, Pune",
    "year": "2025",
    "icon": "smart_toy",
    "description": "Coordinated with faculty and student teams to organize a workshop on modern no-code AI tools led by Prof. (Dr.) Abhijit Tarawade. Assisted in event planning, logistics, and execution while gaining exposure to AI platforms such as Google Opal and Napkin AI, and their applications in workflow automation, data processing, and AI-driven development."
  },
  {
    "title": "Volunteer",
    "event": "Convocation Ceremony, of MCA at MIT Art, Design & Technology University (MIT ADT), Pune",
    "organization": "MIT World Peace University, Pune",
    "year": "2025",
    "icon": "smart_toy",
    "description": "Supported faculty members and organizing staff during the university convocation ceremony by assisting with event coordination, guest guidance, and maintaining discipline. Collaborated with the volunteer team to ensure smooth execution of formal proceedings and efficient event management."
  },
  {
    "title": "Event Organizer - Technophilia Technical Event",
    "event": "Techonophilia 2024 and 2025 - Tech event of BSC CS students",
    "organization": "KVN Naik Arts, Commerce & Science College, Nashik",
    "year": "2024 & 2025",
    "icon": "smart_toy",
    "description": "Served as part of the organizing team for Technophilia, a department level technical event, contributing to event planning, coordination, and execution. Worked closely with faculty and student coordinators to manage participants, oversee logistics, and ensure seamless event flow. Developed leadership, teamwork, and event management skills while helping deliver a successful large-scale technical event."
  }
]